Autodesk.Revit.DB.Visual.Asset.AssetType
The type of RenderingAsset

Autodesk.Revit.DB.Visual.Asset.LibraryName
Library name

Autodesk.Revit.DB.Visual.Asset.Title
Asset title

Autodesk.Revit.DB.Visual.Asset
Represents a connected property of material.